Integrate matrix engine into NPU cluster
